home/Sigma16/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-26 Sun 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sigma16 home page</title>
<meta name="author" content="John T. O'Donnell" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="preamble" class="status">
<h1 class="title">Sigma16 home page</h1>
          <p class="author">John T. O'Donnell</p>
          <p class="date">January 2025</p>
</div>
<div id="content" class="content">
<h1 class="title">Sigma16 home page</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org046f136">About Sigma16</a></li>
</ul>
</div>
</div>
<p>
Sigma16 is a computer architecture designed for research and teaching
in computer systems.  This application provides a complete environment
for programming in assembly and machine language and experimenting
with the architecture.
</p>

<p>
The app runs in a web browser: just click the link in the box below.
You don't need to download or install anything.  Currently it runs on
the Chromium browsers (Chrome, Edge, Opera, DuckDuckGo) but not on
Safari or Firefox.
</p>

<div class="quickstartbox">
<a href="https://sigma16.herokuapp.com/Sigma16/build/release/Sigma16/Sigma16.html">
  Click to run Sigma16 </a>
</div>

<p>
When the app runs in your browser, it will display the User Guide,
which contains introductory tutorials as well as a detailed
specification of the architecture, assembly language, and programming
techniques.  You can also access the User Guide directly, without
launching the app:
</p>

<ul class="org-ul">
<li><a href="https://sigma16.herokuapp.com/Sigma16/build/release/Sigma16/docs/UserGuide/Sigma16UserGuide.html">User Guide (html)</a></li>
<li><a href="https://sigma16.herokuapp.com/Sigma16/build/release/Sigma16/docs/UserGuide/Sigma16UserGuide.pdf">User Guide (pdf)</a></li>
</ul>

<p>
This architecture is simpler than most commercial products, making it
a good vehicle for teaching and experimentation:
</p>

<ul class="org-ul">
<li>It is a 16-bit architecture with a simple yet powerful instruction
set.</li>

<li>A small core subset of the architecture is suitable for introductory
teaching, and more advanced features support systems programming.</li>

<li>Software tools include an assembler, linker, emulator, and IDE.</li>

<li>Examples are provided that illustrate a variety of programming
techniques, data structures, compilation patterns, concurrency and
mutual exclusion, and more.</li>

<li>There is a digital circuit that implements Sigma16. The circuit is
specified at the level of logic gates and flip flops, and is
expressed in Hydra, a functional computer hardware description
language.  Sigma16 programs can be executed using the emulator,
and they can also be executed by simulating the digital circuit
using the Hydra tools.</li>
</ul>

<div id="outline-container-org046f136" class="outline-2">
<h2 id="org046f136">About Sigma16</h2>
<div class="outline-text-2" id="text-org046f136">
<ul class="org-ul">
<li>This sofware is free and open source.</li>

<li>The version number is given in the running app on the Welcome
tab, the User Guide, and the Options tab.</li>

<li>The architecture, implementation, circuits, and examples are
designed and written by John O'Donnell.  See
<a href="https://jtod.github.io/index.html">https://jtod.github.io/index.html</a>.</li>

<li>Copyright &copy; 2025 John T. O'Donnell</li>

<li>License: GNU GPL Version 3</li>

<li>The implementation is available on the
<a href="https://github.com/jtod/Sigma16/">source repository</a>.  The app
won't launch directly from the source repository; you need to
click the link above on this home page to run it.</li>

<li>Some components of the system, including the assembler and linker,
are available as command line tools as well as on the graphical
user interface provided by the web app.  The command line tools
require downloading and installation; see the User Guide for
details.</li>

<li>The full text of the license is given in the source repository in
Sigma16/LICENSE.txt, as well as at
<a href="https://www.gnu.org/licenses">https://www.gnu.org/licenses</a>.</li>
</ul>

<p>
Sigma16 is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License, Version 3, as
published by the Free Software Foundation.
</p>

<p>
Sigma16 is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Sigma16.  If not, see
<a href="https://www.gnu.org/licenses">https://www.gnu.org/licenses</a>.
</p>

<p>
&lt;a href="<a href="https://sigma16.herokuapp.com/Sigma16/build/dev/Sigma16/Sigma16.html">https://sigma16.herokuapp.com/Sigma16/build/dev/Sigma16/Sigma16.html</a>"&gt;
  Development version &lt;/a&gt;
</p>

<p>
321
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John T. O'Donnell (<a href="mailto:john.t.odonnell9@gmail.com">john.t.odonnell9@gmail.com</a>)</p>
<p class="date">Date: January 2025</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
<p class="build-date"> User Guide Build: Sun Jan 26 22:27:59 2025 </p> <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
<!-- post html 341 lines, 0 CL envs -->
